Revit 2026 API

# ConnectorAssignedFlowDirection Property

---

The assigned flow direction of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FlowDirectionType AssignedFlowDirection { get; }
```
```vb
Public ReadOnly Property AssignedFlowDirection As FlowDirectionType
	Get
```
```cpp
public:
property FlowDirectionType AssignedFlowDirection {
	FlowDirectionType get ();
}
```
```fsharp
member AssignedFlowDirection : FlowDirectionType with get
```

#### Property Value

FlowDirectionType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector is not in a family instance. Thrown when the connector's domain is not DomainHvac or DomainPiping. |
| InvalidOperationException | Thrown on failure to get assigned flow direction. |

Flow direction may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace